[
  {
    "name": "Legal Citations",
    "description": "Text with legal citations that can be mistaken for sentence boundaries",
    "text": "The Supreme Court established this principle in Brown v. Board of Education, 347 U.S. 483 (1954). This landmark decision overturned the 'separate but equal' doctrine previously upheld in Plessy v. Ferguson, 163 U.S. 537 (1896). The Court unanimously held that the segregation of public schools violated the Equal Protection Clause of the Fourteenth Amendment. Chief Justice Earl Warren wrote that 'separate educational facilities are inherently unequal.' The plaintiffs, led by Oliver Brown et al., successfully argued that segregation itself constituted discrimination. The decision paved the way for integration and the civil rights movement. In subsequent cases like Cooper v. Aaron, 358 U.S. 1 (1958), the Court affirmed its commitment to desegregation. As noted in the analysis in 47 Harv. L. Rev. 832, 843-44 (1934), these decisions fundamentally changed constitutional interpretation.",
    "charboundary_threshold": 0.7
  },
  {
    "name": "Abbreviations",
    "description": "Text with numerous abbreviations that contain periods",
    "text": "The contract was executed on Jan. 15, 2023, between ABC Corp. and XYZ Inc. Dr. Smith, CEO of ABC Corp., and Prof. Johnson, representing XYZ Inc., signed the agreement at approx. 3:30 p.m. EST. The meeting was also attended by Ms. Davis (Gen. Counsel), Mr. Wilson (CFO), and Lt. Col. Thompson (Head of Security). The agreement covers intellectual property rights, incl. patents, trademarks, etc. Additionally, both parties agreed to maintain confidentiality regarding the terms of the agreement i.e. pricing, delivery schedules, and product specifications. Per the agreement, payments must be made within 30 days of invoice receipt. Cf. the previous contract which allowed 45 days. This represents a significant change vs. prior arrangements. N.B. All disputes must be resolved through arbitration in Washington, D.C."
  },
  {
    "name": "Numbered Lists",
    "description": "Text with numbered lists and sections that create ambiguity",
    "text": "The defendant is charged with the following: 1. Violation of Section 423(a) of the Criminal Code. 2. Conspiracy to commit fraud under Article 18. 3. Obstruction of justice.\n\nThe prosecution must establish the following elements beyond a reasonable doubt: (a) intent to defraud; (b) actual deception of one or more victims; and (c) financial gain resulting from the deception.\n\nThe court has considered the following factors in determining sentencing: i. severity of the offense; ii. criminal history of the defendant; iii. impact on victims; and iv. likelihood of rehabilitation.\n\nDefendant's prior convictions include: 1) Armed robbery (2010). 2) Possession of controlled substances (2015). 3) Parole violation (2016).\n\nThe defense motions are as follows: I. Motion to suppress evidence obtained without a warrant. II. Motion to dismiss counts 3 through 5. III. Motion for change of venue."
  },
  {
    "name": "Quotations & Parentheticals",
    "description": "Complex nested quotations and parenthetical expressions",
    "text": "The Court held that \"when a defendant demonstrates that his trial counsel 'made errors so serious that counsel was not functioning as the \"counsel\" guaranteed the defendant by the Sixth Amendment' and that this deficient performance prejudiced him, the defendant is entitled to relief.\" (citing Strickland v. Washington, 466 U.S. 668, 687 (1984)). Justice Stevens elaborated: \"The defendant must show that there is a reasonable probability that, but for counsel's unprofessional errors [which included 'failing to investigate and present mitigating evidence' (as noted in the dissent)], the result of the proceeding would have been different.\" The majority further noted that \"a reasonable probability is a probability sufficient to undermine confidence in the outcome.\" (internal quotation marks omitted). In his dissent, Justice Scalia contended that the majority \"misapplies our precedents [particularly Wiggins v. Smith and Williams v. Taylor] to create a new constitutional right to 'effective assistance of counsel' at sentencing phases\" (emphasis in original)."
  },
  {
    "name": "Technical Specifications",
    "description": "Technical text with measurements, versions, and decimal points",
    "text": "The device operates at 3.3V DC with a maximum current draw of 0.5A. Version 2.3.4 of the firmware is required for compatibility with the latest security patches. The operating temperature range is -20°C to 85°C. The dimensions are 10.5cm x 8.2cm x 1.5cm with a weight of 120g. When installed, leave 2.5cm clearance on all sides for proper airflow. The component is manufactured using 7nm process technology and has a clock speed of 2.4GHz. Figure 3.2 shows the pin configuration for the main board. Table 4.1 lists the power requirements for each operating mode. The mean time between failures (MTBF) is 50,000 hours at 25°C ambient temperature. Note that Rev. B.2 devices require firmware update 1.5.3 or later. Users should configure port settings to baud rate 9600 bps, 8 data bits, 1 stop bit, no parity."
  },
  {
    "name": "Mixed Punctuation",
    "description": "Text with complex punctuation combinations",
    "text": "The plaintiff's argument (contra the defendant's assertion in para. 4) rests on four key premises: (1) the contract was valid and enforceable; (2) the defendant breached the contract; (3) the breach was material; and (4) the plaintiff suffered damages as a result (see Section II.A. below). Although the defendant claims \"substantial performance\" (an affirmative defense under state law), the evidence contradicts this position! The defendant's representative stated—during a recorded meeting on April 15—that \"we have no intention of fulfilling the remainder of the contract.\" This admission, coupled with the defendant's actions (e.g., redirecting resources to other projects, failing to meet deadlines, etc.), clearly establishes breach. Moreover, the breach was material; indeed, without the promised deliverables, the plaintiff's entire business model was compromised. The damages, therefore, are not merely the $50,000.00 specified in the liquidated damages clause, but rather the consequential damages (i.e., lost profits, damaged customer relationships, etc.) that naturally flowed from the breach."
  },
  {
    "name": "Legislative Text",
    "description": "Complex legislative language with nested clauses",
    "text": "SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the \"Legal Sentence Boundary Detection Improvement Act of 2023\".\n\nSECTION 2. DEFINITIONS.\n\nIn this Act:\n(1) SENTENCE BOUNDARY.—The term \"sentence boundary\" means the demarcation between two adjacent sentences in a text, typically indicated by a period, question mark, or exclamation point followed by a space and an uppercase letter, subject to exceptions for abbreviations, numeric expressions, and other special cases as determined by the Secretary.\n(2) DETECTION ALGORITHM.—The term \"detection algorithm\" means a computational procedure that—\n(A) analyzes text to identify sentence boundaries;\n(B) considers contextual information, including but not limited to—\n(i) presence of abbreviations;\n(ii) presence of numeric expressions;\n(iii) presence of quotation marks; and\n(iv) capitalization patterns; and\n(C) outputs a segmented text with clearly identified sentence boundaries.\n(3) SECRETARY.—The term \"Secretary\" means the Secretary of Language Processing, appointed pursuant to section 5(a)(2) of the Natural Language Processing Enhancement Act (42 U.S.C. 12345)."
  },
  {
    "name": "Contract Terms",
    "description": "Legal contract language with complex nested clauses",
    "text": "5.3 Limitation of Liability. IN NO EVENT SHALL EITHER PARTY BE LIABLE TO THE OTHER PARTY OR ANY THIRD PARTY FOR ANY LOSS OF USE, REVENUE, OR PROFIT OR LOSS OF DATA OR DIMINUTION IN VALUE, OR FOR ANY CONSEQUENTIAL, INCIDENTAL, INDIRECT, EXEMPLARY, SPECIAL, OR PUNITIVE DAMAGES WHETHER ARISING OUT OF BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, REGARDLESS OF WHETHER SUCH DAMAGES WERE FORESEEABLE AND WHETHER OR NOT SUCH PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES, AND NOTWITHSTANDING THE FAILURE OF ANY AGREED OR OTHER REMEDY OF ITS ESSENTIAL PURPOSE.\n\n5.4 Maximum Liability. IN NO EVENT SHALL SELLER'S AGGREGATE LIABILITY ARISING OUT OF OR RELATED TO THIS AGREEMENT, WHETHER ARISING OUT OF OR RELATED TO BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, EXCEED THE TOTAL OF THE AMOUNTS PAID TO SELLER FOR THE PRODUCTS SOLD HEREUNDER OR, AS TO SERVICES, FOR THE AMOUNTS PAID TO SELLER FOR SERVICES PERFORMED IN THE [TWELVE (12)] MONTHS PRECEDING THE EVENT GIVING RISE TO THE CLAIM.\n\n5.5 Exceptions. The limitations set forth in Section 5.3 and Section 5.4 shall not apply to:\n(a) damages arising out of Seller's failure to comply with its obligations under Section 6 (Compliance with Laws);\n(b) Seller's indemnification obligations under Section 8 (Indemnification);\n(c) Seller's breach of Section 9 (Confidential Information); or\n(d) damages arising out of Seller's gross negligence, willful misconduct, or intentional acts."
  },
  {
    "name": "Patent Claims",
    "description": "Patent claims text with extremely long sentences and technical terminology",
    "text": "1. A method for improving sentence boundary detection in legal and technical texts, comprising: receiving, by one or more processors, an input text comprising a plurality of characters; identifying, by the one or more processors, potential sentence boundaries within the input text based on a set of predefined boundary indicators, wherein the potential sentence boundaries comprise positions in the input text where a period, question mark, or exclamation point is followed by a space and a subsequent character; analyzing, by the one or more processors, contextual features surrounding each of the potential sentence boundaries, wherein the contextual features comprise at least one of: presence of abbreviations, presence of legal citations, presence of numeric expressions, presence of quotation marks, presence of parenthetical expressions, or capitalization patterns; determining, by the one or more processors and based on the analysis of the contextual features, which of the potential sentence boundaries are actual sentence boundaries, wherein the determining comprises applying at least one machine learning model trained on annotated legal and technical texts; segmenting, by the one or more processors, the input text at the determined actual sentence boundaries to generate a plurality of sentences; and outputting, by the one or more processors, the generated plurality of sentences.\n\n2. The method of claim 1, wherein the machine learning model comprises at least one of: a recurrent neural network (RNN), a long short-term memory (LSTM) network, a transformer network, or a bidirectional encoder representations from transformers (BERT) model, trained specifically on a corpus of legal and technical documents annotated with sentence boundary information."
  },
  {
    "name": "Case Law",
    "description": "Excerpt from court opinion with complex legal reasoning and citations",
    "text": "As we explained in Daubert v. Merrell Dow Pharmaceuticals, Inc., 509 U.S. 579, 597 (1993), Rule 702's requirement that an expert's testimony pertain to \"scientific knowledge\" establishes a standard of evidentiary reliability. This Court addressed the application of this standard to technical, as opposed to scientific, expert testimony in Kumho Tire Co. v. Carmichael, 526 U.S. 137 (1999). There, we explained that the gatekeeping inquiry must be tied to the facts of a particular case. Id. at 150. This Court further noted that Rule 702 was amended in response to Daubert and this Court's subsequent cases. See Fed. Rule Evid. 702, Advisory Committee Notes to 2000 Amendments. The amendment affirms the trial court's role as gatekeeper but provides that \"all types of expert testimony present questions of admissibility for the trial court.\" Ibid. Consequently, whether the specific expert testimony on the question at issue focuses on specialized observations, the specialized translation of those observations into theory, a specialized theory itself, or the application of such a theory in a particular case, the expert's testimony often will rest \"upon an experience confessedly foreign in kind to [the jury's] own.\" Hand, Historical and Practical Considerations Regarding Expert Testimony, 15 Harv. L. Rev. 40, 54 (1901). For this reason, the trial judge, in all cases of proffered expert testimony, must find that it is properly grounded, well-reasoned, and not speculative before it can be admitted. The trial judge must determine whether the testimony has \"a reliable basis in the knowledge and experience of [the relevant] discipline.\" Daubert, 509 U. S., at 592."
  }
]