[
  {
    "name": "Legal Citations",
    "description": "Text with legal citations that can be mistaken for sentence boundaries",
    "text": "The Supreme Court established this principle in Brown v. Board of Education, 347 U.S. 483 (1954). This landmark decision overturned the 'separate but equal' doctrine previously upheld in Plessy v. Ferguson, 163 U.S. 537 (1896). The Court unanimously held that the segregation of public schools violated the Equal Protection Clause of the Fourteenth Amendment. Chief Justice Earl Warren wrote that 'separate educational facilities are inherently unequal.' The plaintiffs, led by Oliver Brown et al., successfully argued that segregation itself constituted discrimination. The decision paved the way for integration and the civil rights movement. In subsequent cases like Cooper v. Aaron, 358 U.S. 1 (1958), the Court affirmed its commitment to desegregation. As noted in the analysis in 47 Harv. L. Rev. 832, 843-44 (1934), these decisions fundamentally changed constitutional interpretation.",
    "charboundary_threshold": 0.7
  },
  {
    "name": "Abbreviations",
    "description": "Text with numerous abbreviations that contain periods",
    "text": "The contract was executed on Jan. 15, 2023, between ABC Corp. and XYZ Inc. Dr. Smith, CEO of ABC Corp., and Prof. Johnson, representing XYZ Inc., signed the agreement at approx. 3:30 p.m. EST. The meeting was also attended by Ms. Davis (Gen. Counsel), Mr. Wilson (CFO), and Lt. Col. Thompson (Head of Security). The agreement covers intellectual property rights, incl. patents, trademarks, etc. Additionally, both parties agreed to maintain confidentiality regarding the terms of the agreement i.e. pricing, delivery schedules, and product specifications. Per the agreement, payments must be made within 30 days of invoice receipt. Cf. the previous contract which allowed 45 days. This represents a significant change vs. prior arrangements. N.B. All disputes must be resolved through arbitration in Washington, D.C.",
    "charboundary_threshold": 0.6
  },
  {
    "name": "Numbered Lists",
    "description": "Text with numbered lists and sections that create ambiguity",
    "text": "The defendant is charged with the following: 1. Violation of Section 423(a) of the Criminal Code. 2. Conspiracy to commit fraud under Article 18. 3. Obstruction of justice.\n\nThe prosecution must establish the following elements beyond a reasonable doubt: (a) intent to defraud; (b) actual deception of one or more victims; and (c) financial gain resulting from the deception.\n\nThe court has considered the following factors in determining sentencing: i. severity of the offense; ii. criminal history of the defendant; iii. impact on victims; and iv. likelihood of rehabilitation.\n\nDefendant's prior convictions include: 1) Armed robbery (2010). 2) Possession of controlled substances (2015). 3) Parole violation (2016).\n\nThe defense motions are as follows: I. Motion to suppress evidence obtained without a warrant. II. Motion to dismiss counts 3 through 5. III. Motion for change of venue.",
    "charboundary_threshold": 0.8
  },
  {
    "name": "Contract Clauses",
    "description": "Legal contract language with complex nested clauses",
    "text": "5.3 Limitation of Liability. IN NO EVENT SHALL EITHER PARTY BE LIABLE TO THE OTHER PARTY OR ANY THIRD PARTY FOR ANY LOSS OF USE, REVENUE, OR PROFIT OR LOSS OF DATA OR DIMINUTION IN VALUE, OR FOR ANY CONSEQUENTIAL, INCIDENTAL, INDIRECT, EXEMPLARY, SPECIAL, OR PUNITIVE DAMAGES WHETHER ARISING OUT OF BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, REGARDLESS OF WHETHER SUCH DAMAGES WERE FORESEEABLE AND WHETHER OR NOT SUCH PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES, AND NOTWITHSTANDING THE FAILURE OF ANY AGREED OR OTHER REMEDY OF ITS ESSENTIAL PURPOSE.\n\n5.4 Maximum Liability. IN NO EVENT SHALL SELLER'S AGGREGATE LIABILITY ARISING OUT OF OR RELATED TO THIS AGREEMENT, WHETHER ARISING OUT OF OR RELATED TO BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, EXCEED THE TOTAL OF THE AMOUNTS PAID TO SELLER FOR THE PRODUCTS SOLD HEREUNDER OR, AS TO SERVICES, FOR THE AMOUNTS PAID TO SELLER FOR SERVICES PERFORMED IN THE [TWELVE (12)] MONTHS PRECEDING THE EVENT GIVING RISE TO THE CLAIM.\n\n5.5 Exceptions. The limitations set forth in Section 5.3 and Section 5.4 shall not apply to:\n(a) damages arising out of Seller's failure to comply with its obligations under Section 6 (Compliance with Laws);\n(b) Seller's indemnification obligations under Section 8 (Indemnification);\n(c) Seller's breach of Section 9 (Confidential Information); or\n(d) damages arising out of Seller's gross negligence, willful misconduct, or intentional acts.",
    "charboundary_threshold": 0.75
  },
  {
    "name": "Case Law",
    "description": "Excerpt from court opinion with complex legal reasoning and citations",
    "text": "As we explained in Daubert v. Merrell Dow Pharmaceuticals, Inc., 509 U.S. 579, 597 (1993), Rule 702's requirement that an expert's testimony pertain to \"scientific knowledge\" establishes a standard of evidentiary reliability. This Court addressed the application of this standard to technical, as opposed to scientific, expert testimony in Kumho Tire Co. v. Carmichael, 526 U.S. 137 (1999). There, we explained that the gatekeeping inquiry must be tied to the facts of a particular case. Id. at 150. This Court further noted that Rule 702 was amended in response to Daubert and this Court's subsequent cases. See Fed. Rule Evid. 702, Advisory Committee Notes to 2000 Amendments. The amendment affirms the trial court's role as gatekeeper but provides that \"all types of expert testimony present questions of admissibility for the trial court.\" Ibid. Consequently, whether the specific expert testimony on the question at issue focuses on specialized observations, the specialized translation of those observations into theory, a specialized theory itself, or the application of such a theory in a particular case, the expert's testimony often will rest \"upon an experience confessedly foreign in kind to [the jury's] own.\" Hand, Historical and Practical Considerations Regarding Expert Testimony, 15 Harv. L. Rev. 40, 54 (1901). For this reason, the trial judge, in all cases of proffered expert testimony, must find that it is properly grounded, well-reasoned, and not speculative before it can be admitted. The trial judge must determine whether the testimony has \"a reliable basis in the knowledge and experience of [the relevant] discipline.\" Daubert, 509 U. S., at 592.",
    "charboundary_threshold": 0.65
  }
]